# Aggreation

In [2]:
import pandas as pd

In [9]:
df = pd.read_csv("DataSets/Employee.csv")
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34.0,Male,No,0,0
1,Bachelors,2013,Pune,1,28.0,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38.0,Female,No,2,0
3,Masters,2016,Bangalore,3,27.0,Male,No,5,1
4,Masters,2017,Pune,3,24.0,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26.0,Female,No,4,0
4649,Masters,2013,Pune,2,37.0,Male,No,2,1
4650,Masters,2018,New Delhi,3,27.0,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30.0,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33.0,Male,Yes,4,0

In [ ]:
g = df.groupby("City")

In [12]:
df.groupby("City")["Education"].count()

City
Bangalore    2228
New Delhi    1157
Pune         1268
Name: Education, dtype: int64

In [ ]:
g =  df.groupby("City")["Education"].size()

City
Bangalore    2228
New Delhi    1157
Pune         1268
Name: Education, dtype: int64

In [20]:
print(df.groupby("City")["Education"].max())
print(df.groupby("City")["Education"].min())
print(df.groupby("City")["Education"].sum())

City
Bangalore    PHD
New Delhi    PHD
Pune         PHD
Name: Education, dtype: object
City
Bangalore    Bachelors
New Delhi    Bachelors
Pune         Bachelors
Name: Education, dtype: object
City
Bangalore    BachelorsMastersBachelorsBachelorsMastersBache...
New Delhi    BachelorsBachelorsMastersBachelorsMastersBache...
Pune         BachelorsMastersBachelorsBachelorsBachelorsBac...
Name: Education, dtype: object

In [24]:
df.groupby("Education")["Age"].agg(['min','max',"mean","median"])

            min   max       mean  median
Education
Bachelors  22.0  41.0  29.425118    28.0
Masters    22.0  41.0  29.297018    28.0
PHD        22.0  41.0  29.296089    28.0

In [25]:
df.groupby("City").agg({
    "Age":"max",
    "Education":"min",
    "PaymentTier":"mean"
})

            Age  Education  PaymentTier
City
Bangalore  41.0  Bachelors     2.870287
New Delhi  41.0  Bachelors     2.598099
Pune       41.0  Bachelors     2.487382

In [26]:
df.groupby("Education").agg(
    min_age = ('Age',"min"),
    max_payment = ('PaymentTier',"max"),
    avg_payment = ('PaymentTier',"mean")
)

           min_age  max_payment  avg_payment
Education
Bachelors     22.0            3     2.753124
Masters       22.0            3     2.465063
PHD           22.0            3     2.731844

In [28]:
df.groupby("City")["PaymentTier"].mean().reset_index()

        City  PaymentTier
0  Bangalore     2.870287
1  New Delhi     2.598099
2       Pune     2.487382

In [4]:
df.groupby("City")["PaymentTier"].mean().reset_index(name="Avg_PaymentTier")

        City  Avg_PaymentTier
0  Bangalore         2.870287
1  New Delhi         2.598099
2       Pune         2.487382

In [19]:
df.groupby("City")

In [22]:
df.groupby("City").get_group("Pune")

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
1,Bachelors,2013,Pune,1,28.0,Female,No,3,1
4,Masters,2017,Pune,3,24.0,Male,Yes,2,1
8,Bachelors,2016,Pune,3,23.0,Male,No,1,0
11,Bachelors,2016,Pune,3,34.0,Male,No,3,0
12,Bachelors,2018,Pune,3,32.0,Male,Yes,5,1
...,...,...,...,...,...,...,...,...,...
4630,Bachelors,2012,Pune,3,25.0,Female,No,3,1
4644,Bachelors,2015,Pune,3,32.0,Female,Yes,1,1
4645,Masters,2017,Pune,2,31.0,Female,No,2,0
4647,Bachelors,2016,Pune,3,30.0,Male,No,2,0
4649,Masters,2013,Pune,2,37.0,Male,No,2,1